; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	infrared2 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(have_image Star6 thermograph1)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph1)
	(have_image Star9 infrared2)
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 infrared2)
	(have_image Star14 infrared2)
	(have_image Planet15 thermograph0)
	(have_image Star16 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite0 planet15 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet15)
   goals met: 0 of 11
5. (take_image satellite0 planet15 instrument2 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon12 instrument2 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon11 instrument2 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 11
12. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 11
13. (take_image satellite0 planet8 instrument2 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 5 of 11
14. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 5 of 11
15. (take_image satellite0 star13 instrument2 infrared2)
   added: (have_image star13 infrared2)
   goals met: 6 of 11
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 11
17. (take_image satellite0 star14 instrument2 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 11
18. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 7 of 11
19. (take_image satellite0 star16 instrument2 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 8 of 11
20. (turn_to satellite0 star6 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star6)
   goals met: 8 of 11
21. (take_image satellite0 star6 instrument2 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 9 of 11
22. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 9 of 11
23. (take_image satellite0 star7 instrument2 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 10 of 11
24. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 10 of 11
25. (take_image satellite0 star9 instrument2 infrared2)
   added: (have_image star9 infrared2)
   goals met: 11 of 11
